In [6]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [7]:
data_startup=pd.read_csv('data/50_Startups.csv')

In [8]:
data_startup.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [5]:
data_startup.isnull().sum()

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [10]:
data_startup[['R&D Spend','Administration','Marketing Spend','Profit']]=data_startup[['R&D Spend','Administration','Marketing Spend','Profit']].astype(int)

In [12]:
data_startup.head()

   R&D Spend  Administration  Marketing Spend       State  Profit
0     165349          136897           471784    New York  192261
1     162597          151377           443898  California  191792
2     153441          101145           407934     Florida  191050
3     144372          118671           383199    New York  182901
4     142107           91391           366168     Florida  166187

In [13]:
#[Matrix]#Independent Variable 'R&D Spend','Administration','Marketing Spend',State
#{Vector}#Dependent Variable : Profit

In [14]:
X=data_startup[['R&D Spend','Administration','Marketing Spend','State']]
y=data_startup['Profit']

In [15]:
X..value_counts()

   R&D Spend  Administration  Marketing Spend       State
0     165349          136897           471784    New York
1     162597          151377           443898  California
2     153441          101145           407934     Florida
3     144372          118671           383199    New York
4     142107           91391           366168     Florida

In [16]:
y.head()

0    192261
1    191792
2    191050
3    182901
4    166187
Name: Profit, dtype: int32